{
    "person": {
        "firstName": "عبدالجواد",
        "lastName": "الميلادي",
        "role": "مطور برمجيات"
    },
    "newsletter": {
        "title": "اشترك في نشرتي الإخبارية",
        "description": "أكتب أحياناً عن التطور والتكنولوجيا وأشارك أفكاراً برمجية في بعض الأحيان.",
        "button": "اشتراك"
    },
    "home": {
        "label": "الرئيسية",
        "title": "عبد الجواد الميلادي",
        "description": "موقع عبد الجواد الميلادي، يعرض أعمالي كمطور برمجيات",
        "headline": "مطور برمجيات",
        "subline": "أنا عبد الجواد الميلادي، مطور برمجيات ذو خبرة واسعة متخصص في تطوير الأنظمة والتطبيقات وخدمات الويب."
    },
    "about": {
        "label": "عني",
        "title": "عني",
        "description": "تعرف على عبد الجواد الميلادي، مطور برمجيات من ليبيا",
        "intro": {
            "title": "مقدمة",
            "description": "أنا عبد الجواد الميلادي، مطور برمجيات ذو خبرة واسعة متخصص في تطوير الأنظمة والتطبيقات وخدمات الويب، أساعد على بناء حضور رقمي قوي لعلامات تجارية في مختلف المجالات."
        },
        "work": {
            "title": "الخبرة المهنية",
            "companies": {
                "Freelancing": "عمل حر",
                "Full-time Freelancing": "عمل حر",
                "MyTeam": "فريقي الخاص",
                "Decora": "ديكورا",
                "FreelancerCom": "Freelancer.com"
            },
            "experiences": {
                "Freelancing": {
                    "timeframe": "2024 - الأن",
                    "role": "مطور تطبيقات ومواقع",
                    "achievements": "بدأت في تطوير التطبيقات بجانب تصميم وتطوير المواقع. لتوسيع نطاق الخدمات الرقمية التي أقدّمها."
                },
                "Full-time Freelancing": {
                    "timeframe": "2024 - 2023",
                    "role": "مطور مواقع",
                    "achievements": "بدأت في تطوير التطبيقات بجانب تصميم وتطوير المواقع. لتوسيع نطاق الخدمات الرقمية التي أقدّمها."
                },
                "MyTeam": {
                    "timeframe": "2023 - 2022",
                    "role": "مصمم وسائل تواصل اجتماعي",
                    "achievements": "قمت ببناء فريق عمل متخصص في إدارة حسابات السوشيال ميديا والتواصل مع العملاء. حيث أنني قمت بإدارة حسابات أكثر من 6 شركات في نفس الوقت."
                },
                "Decora": {
                    "timeframe": "2022 - 2021",
                    "role": "مصمم هويات بصرية",
                    "achievements": "بدأت في تطوير التطبيقات بجانب تصميم وتطوير المواقع. لتوسيع نطاق الخدمات الرقمية التي أقدّمها."
                },
                "FreelancerCom": {
                    "timeframe": "2021",
                    "role": "مصمم هويات بصرية",
                    "achievements": "بدأت كمصمم هويات بصرية على المنصة. وقمت بالعمل مع عملاء من بريطانيا وأستراليا وأمريكا."
                }
            }
        },
        "studies": {
            "title": "الدراسات",
            "institutions": {
                "جامعة طرابلس": {
                    "description": "درس علوم الحاسب وهندسة البرمجيات."
                },
                "منصات التعلم عبر الإنترنت": {
                    "description": "أكمل دورات متقدمة في تطوير الويب الحديث وتقنيات السحابة."
                }
            }
        },
        "technical": {
            "title": "المهارات التقنية",
            "skills": {
                "Frontend & UI Engineering": {
                    "title": "هندسة الواجهات الأمامية والتصميم",
                    "description": "بناء واجهات ويب حديثة ومتجاوبة باستخدام JavaScript frameworks مثل React وNext.js، مع التركيز القوي على UX/UI design، دعم اللغة العربية من اليمين إلى اليسار (RTL)، TypeScript، CSS-in-JS، وتجربة المستخدم النظيفة مع accessibility وperformance optimization."
                },
                "Backend & APIs": {
                    "title": "الخلفية والواجهات البرمجية",
                    "description": "تصميم وتطوير أنظمة الخلفية باستخدام Node.js وExpress.js، RESTful APIs وGraphQL، MongoDB وPostgreSQL، مع التركيز على authentication (JWT, OAuth)، role-based access control، data validation، caching strategies، والمنطق التجاري المعقد."
                },
                "Databases & System Architecture": {
                    "title": "قواعد البيانات وهندسة النظم",
                    "description": "العمل مع قواعد البيانات العلاقية (MySQL, PostgreSQL) وغير العلاقية (MongoDB)، تصميم database schemas وdata modeling، database optimization، indexing strategies، ودعم المنصات القابلة للتوسع مثل dashboards، إدارة الطلبات، وأنظمة إدارة المحتوى."
                },
                "Server, Cloud & Deployment": {
                    "title": "الخادم والسحابة والنشر",
                    "description": "إدارة بيئات VPS وخوادم Linux (Ubuntu, CentOS)، domain management وDNS configuration، SSL certificates، load balancing، Redis caching، Docker containers، CI/CD pipelines مع GitHub Actions، ونشر التطبيقات على AWS، DigitalOcean، وVercel للإنتاج."
                },
                "Performance, Analytics & Tracking": {
                    "title": "الأداء والتحليلات والتتبع",
                    "description": "تنفيذ analytics pipelines مع Google Analytics 4، conversion tracking وevent-based measurement باستخدام Google Tag Manager، Meta Pixel، Hotjar لـ heatmaps، A/B testing مع Optimizely، وperformance monitoring مع tools مثل Lighthouse وWeb Vitals."
                },
                "Security & System Awareness": {
                    "title": "الأمان والوعي بالنظام",
                    "description": "فهم أساسيات أمان الويب (OWASP Top 10)، HTTPS implementation، CORS، CSRF protection، input validation، penetration testing concepts، traffic monitoring مع Cloudflare، access control، وGDPR compliance للتطبيقات الأكثر أماناً."
                }
            }
        }
    },
    "testimonials": [
        {
            "id": "testimonial-1",
            "name": "هاشم الشكري",
            "role": "شركة النخبة المضيئة",
            "testimonial": "لقد حظيت بفرصة العمل مع عبدالجواد، وخلال هذا التعاون أثبت كفاءته ومهنيته العالية، كما أبدى تجاوباً سريعاً ومرونة في التعامل مع متطلبات المشروع. قام بتصميم موقع إلكتروني متكامل لشركة النخبة المضيئة المتخصصة في استيراد الأخشاب، مع مراعاة التفاصيل والجودة في كل جانب من جوانب التصميم والتنفيذ.",
            "rating": 5
        },
        {
            "id": "testimonial-2",
            "name": "د. مفتاح الحداد",
            "role": "جامعة الزيتونة، مجلة روافد المعرفة",
            "testimonial": "قدر الله لنا أن نتعرف على المهندس عبدالجواد الميلادي الذي رحب بطلبنا وتقبله بكل ود وهو أن ينفذ لنا بناء موقع إلكتروني رائع للمجلة العلمية المحكمة التي أتولى رئاسة تحريرها. موقع مجلة \"روافد المعرفة\" الذي أسسه المهندس عبدالجواد الميلادي يظهر جودة وكفاءة عالية من حيث التصميم والتنظيم، ويعكس شمولية واضحة في عرض كل ما تحتاجه المجلة من أهداف أهداف وسياسات وضوابط، بالإضافة إلى توفير محتوى ثنائي اللغة (العربية والإنجليزية) وشرح مفصل لنظام التحكيم المزدوج التعمية. كما يحتوي الموقع على معلومات مهمة مثل دعوة تقديم الأبحاث، إدراج المجلة في منصات ومواقع فهرسة علمية، وسياسة تضارب المصالح، مما يعكس الاهتمام بالشفافية والمعايير العلمية العالمية. لقد جعله عبدالجواد موقعا يتميز بالتنظيم العام المريح، ويتيح سهولة الوصول للمعلومات الأساسية حول المجلة وأهدافها، وبذلك فالموقع يعزز من تجربة المستخدم ويخدم القارئ والباحث بشكل فعال. بشكل عام، العمل الذي تم تقديمه بواسطة عبدالجواد يظهر احترافية ومهنية عالية في بناء موقع إلكتروني شامل يعكس هوية المجلة ويوفر منصتها الرقمية بأفضل صورة ممكنة، ونتمنى له مزيد من التقدم والعطاء، وله منا جزيل الشكر والتقدير",
            "rating": 5
        },
        {
            "id": "testimonial-3",
            "name": "مالك التميمي",
            "role": "مهندس برمجيات",
            "testimonial": "سعدتُ جداً بالتعاون مع عبد الجواد الميلادي في مشروع لتطوير الويب. يتسم عمله بموثوقية عالية، مع اهتمام استثنائي بالتفاصيل وتركيز قوي على إنشاء واجهات مستخدم أنيقة وسهلة الاستخدام. يُظهر عبد الجواد دائماً مستوى عالٍ من الاحترافية والخبرة التقنية والإبداع، مما يجعله شريكاً قيماً لأي مشروع تطوير. لذا، أنصح بالتعامل معه بشدة لأي شخص يبحث عن الجودة والنتائج المضمونة.",
            "rating": 5
        },
        {
            "id": "testimonial-4",
            "name": "محمد",
            "role": "شركة السامية",
            "testimonial": "حظينا بتجربة ممتازة في العمل مع عبد الجواد على موقعنا الإلكتروني الجديد للأدوية. كان التواصل واضحًا، واستمع إلى أفكارنا، وكانت النتائج النهائية مذهلة. كان متاحًا دائمًا للإجابة على الأسئلة، وعلى دراية كبيرة، وسهل التعامل معه، ومحترفًا. نوصي به بشدة وسنتعامل معه بالتأكيد مرة أخرى.",
            "rating": 5
        },
        {
            "id": "testimonial-5",
            "name": "مدثر سالم",
            "role": "خليك صحي",
            "testimonial": "خدمت مع الأخ عبد الجواد في تصميم موقع إلكتروني خاص ببيع المكملات الغذائية، وبصراحة كانت تجربة ممتازة جداً. تعامل راقي، شغل احترافي، وسرعة في الإنجاز فوق المتوقع. فهم كل التفاصيل اللي نبيها بالضبط، وصمّم الموقع بطريقة منظمة وسهلة الاستخدام، مع لمسة تصميم جميلة تعطي ثقة للمستخدم. أهم حاجة لاحظتها هي الاهتمام بالتفاصيل والدعم حتى بعد التسليم، وهذا يدل على خبرة واحترام للعميل. أنصح أي شخص يبي موقع احترافي يتعامل معه بدون تردد. شكراً على الخدمة الممتازة.",
            "rating": 5
        }
    ],
    "blog": {
        "label": "المدونة",
        "title": "أكتب عن التصميم والتكنولوجيا...",
        "description": "اقرأ ما كان {name} يفعله مؤخراً"
    },
    "work": {
        "label": "المشاريع",
        "title": "مشاريعي",
        "description": "مشاريع التصميم والتطوير بواسطة {name}"
    },
    "gallery": {
        "label": "المعرض",
        "title": "معرض صوري",
        "description": "مجموعة صور بواسطة {name}"
    },
    "projectCard": {
        "label": "اقرأ دراسة الحالة",
        "link": "رابط المشروع"
    },
    "footer": {
        "copyright": "© {year} عبدالجواد الميلادي. جميع الحقوق محفوظة."
    }
}